; domain
(define (domain domain1-no-reallocation)

(:requirements :adl)

(:types
    trackpart track trainunit - object
    icm virm sng slt - trainunit ; these are the different types of train units
)

(:predicates 
    (nextTo ?x ?y - trackpart) ;track part x next to other track part y
    (onTrack ?x - trackPart ?y - track) ;track part x on track y
    (at ?x - trainunit ?y - trackpart) ;train unit x on track part y
    (hasBeenParked ?x - trainunit) ;true if x is parked on some track
    (free ?x - trackpart) ;trackpart x has nothing parked there
    (parkedOn ?x - trainunit ?y - track) ; indicates x parked on track y
    (onPath ?x) ;trackpart x is on the arrival/departure path L
    (switch ?x) ;trackpart x is a switch
    (lastfree ?x - trackpart ?y - track) ; last free trackpart x of track y
    (lastfreePath ?x - trackpart) ; last free trackpart x of path L
    (validPath ?x ?y - trackpart) ; path x to y is valid connected path
)

(:action check-path
    :parameters (?from ?to - trackpart)
    :precondition (or
        (nextTo ?from ?to)
        (exists (?next - trackpart) (and (nextTo ?from ?next) (validPath ?next ?to)))
    )
    :effect (and
        (validPath ?from ?to)
    )
)


(:action move-from-arrival-to-track
    :parameters (?train - trainunit ?from ?next ?toprev ?to - trackpart ?t - track)
    :precondition (and
        ; (not (hasBeenParked ?train))
        (not (parkedOn ?train ?t))
        (at ?train ?from)
        (onPath ?from)
        (free ?next)
        (free ?to)
        (lastfree ?to ?t)
        (nextTo ?toprev ?to)
        (onTrack ?to ?t)
        (validPath ?from ?to))
    :effect (and
        (at ?train ?to)         (not (at ?train ?from))
        (free ?from)            (not (free ?to))
        (when (not (switch ?toprev)) (lastfree ?toprev ?t))
        (not (lastfree ?to ?t))
        (hasBeenParked ?train)
        (parkedOn ?train ?t))
)

(:action move-from-track-to-departure
    :parameters (?train - trainunit ?from ?next ?toprev ?to - trackpart ?t - track)
    :precondition (and
        (parkedOn ?train ?t)
        (at ?train ?from)
        (onTrack ?from ?t)
        (nextTo ?next ?from)
        (free ?next)
        (free ?to)
        (nextTo ?to ?toprev)
        (onPath ?to)
        (lastfreePath ?to)
        (validPath ?to ?from)
        (forall (?unit - trainunit) (hasBeenParked ?unit)))
    :effect (and
        (at ?train ?to)         (not (at ?train ?from))
        (free ?from)            (not (free ?to))
        (lastfreePath ?toprev)  (not (lastfreePath ?to))
        (not (parkedOn ?train ?t)))
)
)

; problem
(define (problem problem2-no-reallocation) (:domain domain1-no-reallocation)
(:objects
   train1 - sng
   train2 - sng
   train3 - icm
   train4 - virm
   train5 - slt
   train6 - slt
   v1 v2 v3 v4 v5 v6 t0 t1 t2 t3 t4 t5 t6 - trackpart
   track1 track2 - track
)
(:init
   (at train1 v1)
   (nextTo v2 v1)
   (at train2 v2)
   (nextTo v3 v2)
   (at train3 v3)
   (nextTo v4 v3)
   (at train4 v4)
   (nextTo v5 v4)
   (at train5 v5)
   (nextTo v6 v5)
   (at train6 v6)
   (nextTo v1 t0)
   (nextTo t0 t1)
   (free t0)
   (free t1)
   (nextTo t1 t2)
   (free t2)
   (nextTo t2 t3)
   (free t3)
   (nextTo t3 t4)
   (free t4)
   (nextTo t0 t5)
   (free t5)
   (nextTo t5 t6)
   (free t6)
   (onTrack t1 track1)
   (onTrack t2 track1)
   (onTrack t3 track1)
   (onTrack t4 track1)
   (onTrack t5 track2)
   (onTrack t6 track2)
   (lastfree t4 track1)
   (lastfree t6 track2)
   (onPath v1)
   (onPath v2)
   (onPath v3)
   (onPath v4)
   (onPath v5)
   (onPath v6)
   (lastfreePath v6)
   (switch t0)
)
(:goal (and
   (forall (?t - slt) (or (at ?t v3) (at ?t v5)))
   (forall (?t - sng) (or (at ?t v4) (at ?t v6)))
   (forall (?t - virm) (or (at ?t v2)))
   (forall (?t - icm) (or (at ?t v1)))
   (forall (?t - trainunit) (hasBeenParked ?t))
)))

; plan
1. (check-path t5 t6)
   added: (validpath t5 t6)
   goals met: 0 of 5
2. (check-path t0 t6)
   added: (validpath t0 t6)
   goals met: 0 of 5
3. (check-path v1 t6)
   added: (validpath v1 t6)
   goals met: 0 of 5
4. (check-path v2 t6)
   added: (validpath v2 t6)
   goals met: 0 of 5
5. (check-path v3 t6)
   added: (validpath v3 t6)
   goals met: 0 of 5
6. (check-path v4 t6)
   added: (validpath v4 t6)
   goals met: 0 of 5
7. (move-from-arrival-to-track train1 v1 t0 t5 t6 track2)
   deleted: (at train1 v1) (free t6) (lastfree t6 track2)
   added: (at train1 t6) (free v1) (lastfree t5 track2) (hasbeenparked train1) (parkedon train1 track2)
   goals met: 0 of 5
8. (check-path t0 t5)
   added: (validpath t0 t5)
   goals met: 0 of 5
9. (check-path v1 t5)
   added: (validpath v1 t5)
   goals met: 0 of 5
10. (check-path v2 t5)
   added: (validpath v2 t5)
   goals met: 0 of 5
11. (check-path v3 t5)
   added: (validpath v3 t5)
   goals met: 0 of 5
12. (check-path v4 t5)
   added: (validpath v4 t5)
   goals met: 0 of 5
13. (check-path v5 t5)
   added: (validpath v5 t5)
   goals met: 0 of 5
14. (check-path v6 t5)
   added: (validpath v6 t5)
   goals met: 0 of 5
15. (move-from-arrival-to-track train2 v2 v1 t0 t5 track2)
   deleted: (at train2 v2) (free t5) (lastfree t5 track2)
   added: (at train2 t5) (free v2) (hasbeenparked train2) (parkedon train2 track2)
   goals met: 0 of 5
16. (check-path t3 t4)
   added: (validpath t3 t4)
   goals met: 0 of 5
17. (check-path t2 t4)
   added: (validpath t2 t4)
   goals met: 0 of 5
18. (check-path t1 t4)
   added: (validpath t1 t4)
   goals met: 0 of 5
19. (check-path t0 t4)
   added: (validpath t0 t4)
   goals met: 0 of 5
20. (check-path v1 t4)
   added: (validpath v1 t4)
   goals met: 0 of 5
21. (check-path v2 t4)
   added: (validpath v2 t4)
   goals met: 0 of 5
22. (check-path v3 t4)
   added: (validpath v3 t4)
   goals met: 0 of 5
23. (move-from-arrival-to-track train3 v3 v2 t3 t4 track1)
   deleted: (at train3 v3) (free t4) (lastfree t4 track1)
   added: (at train3 t4) (free v3) (lastfree t3 track1) (hasbeenparked train3) (parkedon train3 track1)
   goals met: 0 of 5
24. (check-path t2 t3)
   added: (validpath t2 t3)
   goals met: 0 of 5
25. (check-path t1 t3)
   added: (validpath t1 t3)
   goals met: 0 of 5
26. (check-path t0 t3)
   added: (validpath t0 t3)
   goals met: 0 of 5
27. (check-path v1 t3)
   added: (validpath v1 t3)
   goals met: 0 of 5
28. (check-path v2 t3)
   added: (validpath v2 t3)
   goals met: 0 of 5
29. (check-path v3 t3)
   added: (validpath v3 t3)
   goals met: 0 of 5
30. (check-path v4 t3)
   added: (validpath v4 t3)
   goals met: 0 of 5
31. (move-from-arrival-to-track train4 v4 v3 t2 t3 track1)
   deleted: (at train4 v4) (free t3) (lastfree t3 track1)
   added: (at train4 t3) (free v4) (lastfree t2 track1) (hasbeenparked train4) (parkedon train4 track1)
   goals met: 0 of 5
32. (check-path t1 t2)
   added: (validpath t1 t2)
   goals met: 0 of 5
33. (check-path t0 t2)
   added: (validpath t0 t2)
   goals met: 0 of 5
34. (check-path v1 t2)
   added: (validpath v1 t2)
   goals met: 0 of 5
35. (check-path v2 t2)
   added: (validpath v2 t2)
   goals met: 0 of 5
36. (check-path v3 t2)
   added: (validpath v3 t2)
   goals met: 0 of 5
37. (check-path v4 t2)
   added: (validpath v4 t2)
   goals met: 0 of 5
38. (check-path v5 t2)
   added: (validpath v5 t2)
   goals met: 0 of 5
39. (move-from-arrival-to-track train5 v5 v4 t1 t2 track1)
   deleted: (at train5 v5) (free t2) (lastfree t2 track1)
   added: (at train5 t2) (free v5) (lastfree t1 track1) (hasbeenparked train5) (parkedon train5 track1)
   goals met: 0 of 5
40. (check-path t0 t1)
   added: (validpath t0 t1)
   goals met: 0 of 5
41. (check-path v1 t1)
   added: (validpath v1 t1)
   goals met: 0 of 5
42. (check-path v2 t1)
   added: (validpath v2 t1)
   goals met: 0 of 5
43. (check-path v3 t1)
   added: (validpath v3 t1)
   goals met: 0 of 5
44. (check-path v4 t1)
   added: (validpath v4 t1)
   goals met: 0 of 5
45. (check-path v5 t1)
   added: (validpath v5 t1)
   goals met: 0 of 5
46. (check-path v6 t1)
   added: (validpath v6 t1)
   goals met: 0 of 5
47. (move-from-arrival-to-track train6 v6 v5 t0 t1 track1)
   deleted: (at train6 v6) (free t1) (lastfree t1 track1)
   added: (at train6 t1) (free v6) (hasbeenparked train6) (parkedon train6 track1)
   goals met: 1 of 5
48. (move-from-track-to-departure train2 t5 t0 v5 v6 track2)
   deleted: (at train2 t5) (free v6) (lastfreepath v6) (parkedon train2 track2)
   added: (at train2 v6) (free t5) (lastfreepath v5)
   goals met: 1 of 5
49. (move-from-track-to-departure train6 t1 t0 v4 v5 track1)
   deleted: (at train6 t1) (free v5) (lastfreepath v5) (parkedon train6 track1)
   added: (at train6 v5) (free t1) (lastfreepath v4)
   goals met: 1 of 5
50. (move-from-track-to-departure train1 t6 t5 v3 v4 track2)
   deleted: (at train1 t6) (free v4) (lastfreepath v4) (parkedon train1 track2)
   added: (at train1 v4) (free t6) (lastfreepath v3)
   goals met: 2 of 5
51. (move-from-track-to-departure train5 t2 t1 v2 v3 track1)
   deleted: (at train5 t2) (free v3) (lastfreepath v3) (parkedon train5 track1)
   added: (at train5 v3) (free t2) (lastfreepath v2)
   goals met: 3 of 5
52. (move-from-track-to-departure train4 t3 t2 v1 v2 track1)
   deleted: (at train4 t3) (free v2) (lastfreepath v2) (parkedon train4 track1)
   added: (at train4 v2) (free t3) (lastfreepath v1)
   goals met: 4 of 5
53. (move-from-track-to-departure train3 t4 t3 t0 v1 track1)
   deleted: (at train3 t4) (free v1) (lastfreepath v1) (parkedon train3 track1)
   added: (at train3 v1) (free t4) (lastfreepath t0)
   goals met: 5 of 5
